In [2]:
import pandas as pd
import seaborn as sns
import numpy as np

In [10]:
np.random.seed(32)
tips_10 = sns.load_dataset("tips").sample(10)

In [11]:
tips_10

     total_bill   tip     sex smoker   day    time  size
33        20.69  2.45  Female     No   Sat  Dinner     4
114       25.71  4.00  Female     No   Sun  Dinner     3
206       26.59  3.41    Male    Yes   Sat  Dinner     3
149        7.51  2.00    Male     No  Thur   Lunch     2
20        17.92  4.08    Male     No   Sat  Dinner     2
87        18.28  4.00    Male     No  Thur   Lunch     2
109       14.31  4.00  Female    Yes   Sat  Dinner     2
222        8.58  1.92    Male    Yes   Fri   Lunch     1
23        39.42  7.58    Male     No   Sat  Dinner     4
189       23.10  4.00    Male    Yes   Sun  Dinner     3

In [5]:
from numpy import NaN

In [12]:
tips_10.loc[np.random.permutation(tips_10.index)[:4], 'total_bill'] = NaN

In [13]:
tips_10

     total_bill   tip     sex smoker   day    time  size
33        20.69  2.45  Female     No   Sat  Dinner     4
114       25.71  4.00  Female     No   Sun  Dinner     3
206         NaN  3.41    Male    Yes   Sat  Dinner     3
149         NaN  2.00    Male     No  Thur   Lunch     2
20        17.92  4.08    Male     No   Sat  Dinner     2
87        18.28  4.00    Male     No  Thur   Lunch     2
109       14.31  4.00  Female    Yes   Sat  Dinner     2
222         NaN  1.92    Male    Yes   Fri   Lunch     1
23          NaN  7.58    Male     No   Sat  Dinner     4
189       23.10  4.00    Male    Yes   Sun  Dinner     3

In [14]:
count_sex = tips_10.groupby('sex').count()
count_sex

        total_bill  tip  smoker  day  time  size
sex
Male             3    7       7    7     7     7
Female           3    3       3    3     3     3

In [15]:
def fill_na_mean(X):
    avg = X.mean()
    return X.fillna(avg)

In [16]:
total_bill_group_mean = tips_10.groupby('sex').total_bill.transform(fill_na_mean)

In [17]:
tips_10['fill_total_bill'] = total_bill_group_mean

In [18]:
tips_10

     total_bill   tip     sex smoker   day    time  size  fill_total_bill
33        20.69  2.45  Female     No   Sat  Dinner     4        20.690000
114       25.71  4.00  Female     No   Sun  Dinner     3        25.710000
206         NaN  3.41    Male    Yes   Sat  Dinner     3        19.766667
149         NaN  2.00    Male     No  Thur   Lunch     2        19.766667
20        17.92  4.08    Male     No   Sat  Dinner     2        17.920000
87        18.28  4.00    Male     No  Thur   Lunch     2        18.280000
109       14.31  4.00  Female    Yes   Sat  Dinner     2        14.310000
222         NaN  1.92    Male    Yes   Fri   Lunch     1        19.766667
23          NaN  7.58    Male     No   Sat  Dinner     4        19.766667
189       23.10  4.00    Male    Yes   Sun  Dinner     3        23.100000